public_html/linux_mint_post_instalacion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-20 vie 12:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>linux mint post instalacion</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">linux mint post instalacion</h1>
<p>
Con la instalación de <a href="linux_mint.html#ID-9d4a6d4f-e0be-47b4-8780-19a414c8230e">linux mint</a> no termina la configuración del sistema, todavía realizo todos estos pasos para dejar a mi gusto el resto de aplicaciones.
</p>

<p>
El primer paso es la instalación de <a href="https://www.insynchq.com/">Insync</a> y crear la carpeta "~/GDrive" donde hacer una sincronización selectiva de "dotfiles" y "sherloscripts" para poder seguir adelante con la configuración.
</p>

<p>
Tras esto hay que:
</p>
<ul class="org-ul">
<li>Actualizar el sistema</li>
<li>Instalar emacs</li>
<li>Instalar hugo</li>
<li>Instalar diccionario de Aspell en español</li>
<li>Eliminar el compilador de C "gcc" e instalar "clang"</li>
<li>Instalar git, generar la llave ssh y copiarla a GitHub</li>
<li>Instalación y configuración de Zerotier (<a href="https://sherblog.pro/primeros-pasos-con-zerotier/">Artículo</a>)</li>
<li>Instalar <a href="https://rclone.org/">Rclone</a> y ejecutar la configuración para crear el directorio</li>
<li>Ajuste de Dotfiles. <a href="https://sherblog.pro/mi-gesti%C3%B3n-de-los-archivos-de-configuraci%C3%B3n/">Artículo</a> en Sherblog.pro</li>
</ul>

<p>
Y este es el script completo:
</p>

<div class="org-src-container">
<pre class="src src-bash">
# Actualizar el sistema
sudo apt update

# Evitar el error "failed to open \EFI\ubuntu\ - Not Found" en el arranque
sudo grub-install --no-uefi-secure-boot /dev/sda
sudo update-grub

# Crear el enlace a los Dotfiles
ln -si ~/GDrive/dotfiles ~/dotfiles

# Eliminar el compilador cd c gcc e instalar clang (problemas Sqlite)
# (Esta parte no es necesaria con Linux Mint 22)
sudo apt remove gcc
sudo apt install clang

# Instalación de Emacs y corrección ortográfica
sudo apt install emacs
sudo apt install ispell
sudo apt install aspell-es

# Instalación de Hugo
sudo apt install hugo

# Instalación del cliente para Wireguard
sudo apt install wireguard
sudo apt install resolvc

# Instalación y configuración de git
sudo apt install git
git config --global user.email sherlockes@yahoo.es
git config --global user.name sherlockes

# Instalación de Zerotier y adhesión a red personal
curl -s https://install.zerotier.com/ | sudo bash
sudo zerotier-cli join 83048a0632dad18a

# Instala Rclone y crea el directorio de configuración
sudo -v ; curl https://rclone.org/install.sh | sudo bash
mkdir -p ~/.config/rclone

# Configuración mediante Dotfiles
ln -si ~/dotfiles/bash/.bash_aliases ~/.bash_aliases
ln -si ~/dotfiles/emacs/.emacs ~/.emacs
ln -si ~/dotfiles/emacs/.emacs.d/bookmarks ~/.emacs.d/bookmarks
ln -si ~/dotfiles/ssh/config ~/.ssh/config
ln -si ~/dotfiles/rclone/rclone.conf ~/.config/rclone/rclone.conf

# Eliminar paquetes sobrantes
sudo apt autoremove

# Genera la llave ssh
ssh-keygen
</pre>
</div>


<ul class="org-ul">
<li>Tras esto hay que acceder a <a href="https://my.zerotier.com/">Zerotier</a> para permitir el acceso del ordenador a la red y asignarle un nombre e IP.</li>

<li>Tras la instalación del cliente para Wireguard hay que copiar el archivo de configuración tal y como indica este <a href="https://sherblog.pro/configurar-wireguard-de-home-assistant-en-cliente-linux/">artículo</a>.</li>
</ul>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-08-30</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 12:43</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
